# 6.1 Reading and Writing Data in Text Format

In [1]:
import numpy as np
import pandas as pd

Input and output typically falls into a few main categories: reading text files and other
more efficient on-disk formats, loading data from databases, and interacting with network
sources like web APIs.

---

The optional arguments for parsing functions may fall into
a few categories:

- Indexing

    Can treat one or more columns as the returned DataFrame, and whether to get
    column names from the file, the user, or not at all.
    Type inference and data conversion
    This includes the user-defined value conversions and custom list of missing value
    markers.

- Datetime parsing

    Includes combining capability, including combining date and time information
    spread over multiple columns into a single column in the result.
    
- Iterating

    Support for iterating over chunks of very large files.
    
- Unclean data issues

    Skipping rows or a footer, comments, or other minor things like numeric data
    with thousands separated by commas.

In [2]:
df = pd.read_csv('ex1.csv')

In [3]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
pd.read_table('ex1.csv', sep=',')

C:\Users\Agus Richard Lubis\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_csv('ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [6]:
pd.read_csv('ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
names = ['a', 'b', 'c', 'd', 'message']
pd.read_csv('ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

Form a hierarchical index from multiple columns

In [10]:
parsed = pd.read_csv('csv_mindex.csv', index_col=['key1', 'key2'])

In [11]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [14]:
result = pd.read_table('ex3.txt', sep='\s+')
# seperated by whitespace, the sep is a regular expression

C:\Users\Agus Richard Lubis\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

In [15]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [16]:
pd.read_csv('ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
result = pd.read_csv('ex5.csv') # null between sep and NA will be treated as NaN

In [19]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [20]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

The na_values option can take either a list or set of strings to consider missing
values:

In [21]:
result = pd.read_csv('ex5.csv', na_values=['NULL'])

In [22]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [23]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}
pd.read_csv('ex5.csv', na_values=sentinels)
# in here we specified key as column label, and values treated as null

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

---

## Writing Data to Text Format

In [24]:
data = pd.read_csv('ex5.csv')

In [25]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [26]:
data.to_csv('out.csv')

In [27]:
import sys

In [28]:
data.to_csv(sys.stdout, sep='|') # sys.stdout will print to the console(?)

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [29]:
data.to_csv(sys.stdout, na_rep='NULL')
# missing values will become NULL (string)

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [30]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [31]:
dates = pd.date_range('1/1/2000', periods=7)

In [33]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [34]:
ts = pd.Series(np.arange(7), index=dates)

In [35]:
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [36]:
ts.to_csv('tseries.csv')

C:\Users\Agus Richard Lubis\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.

---

## Working with Delimited Formats

Using python built-in csv module

In [37]:
import csv

In [44]:
f = open('ex7.csv')
type(f)

_io.TextIOWrapper

In [45]:
reader = csv.reader(f)
type(reader)

_csv.reader

In [46]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [47]:
# first, we read the file into a list of lines
with open('ex7.csv') as f:
    lines = list(csv.reader(f))

In [48]:
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [52]:
# split the lines into the header and the data lines
header, values = lines[0], lines[1:]

In [53]:
header

['a', 'b', 'c']

In [54]:
values

[['1', '2', '3'], ['1', '2', '3']]

In [57]:
list(zip(*values))

[('1', '1'), ('2', '2'), ('3', '3')]

In [58]:
a, b, *c = 1, 2, 3, 4, 5, 6

In [59]:
c

[3, 4, 5, 6]

In [62]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [63]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}


---

## JSON Data

JSON: JavaScript Object Notation. Example:

In [66]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
             {"name": "Katie", "age": 38,
              "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

JSON is very nearly valid Python code with the exception of its null value null and
some other nuances (such as disallowing trailing commas at the end of lists). The
basic types are objects (dicts), arrays (lists), strings, numbers, booleans, and nulls. All
of the keys in an object must be strings

In [67]:
import json

In [72]:
type(obj)

str

In [68]:
result = json.loads(obj) # load obj (string) turn it to dict

In [69]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [71]:
type(result)

dict

In [73]:
# conver a python object back to JSON
asjson = json.dumps(result)

In [74]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [75]:
type(asjson)

str

In [77]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [78]:
siblings

    name  age
0  Scott   30
1  Katie   38

The pandas.read_json can automatically convert JSON datasets in specific arrangements
into a Series or DataFrame.

In [79]:
data = pd.read_json('example.json')

In [80]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [81]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

---

## XML and HTML: Web Scraping

Python has many libraries for reading and writing data in the ubiquitous HTML and
XML formats. Examples include lxml, Beautiful Soup, and html5lib. While lxml is
comparatively much faster in general, the other libraries can better handle malformed
HTML or XML files.

pd.read_html, automatically parse tables out of HTML files as DataFrame objets. The pandas.read_html function has a number of options, but by default it searches for and attempts to parse all tabular data contained within table tags.

In [82]:
tables = pd.read_html('fdic_failed_bank_list.html')
# return a list

In [87]:
tables

[                                            Bank Name                City  ST  \
 0                                The Enloe State Bank              Cooper  TX
 1                 Washington Federal Bank for Savings             Chicago  IL
 2     The Farmers and Merchants State Bank of Argonia             Argonia  KS
 3                                 Fayette County Bank          Saint Elmo  IL
 4   Guaranty Bank, (d/b/a BestBank in Georgia & Mi...           Milwaukee  WI
 5                                      First NBC Bank         New Orleans  LA
 6                                       Proficio Bank  Cottonwood Heights  UT
 7                       Seaway Bank and Trust Company             Chicago  IL
 8                              Harvest Community Bank          Pennsville  NJ
 9                                         Allied Bank            Mulberry  AR
 10                       The Woodbury Banking Company            Woodbury  GA
 11                             First CornerStone Bank     King of Prussia  PA
 12                                 Trust Company Bank             Memphis  TN
 13                         North Milwaukee State Bank           Milwaukee  WI
 14                             Hometown National Bank            Longview  WA
 15                                The Bank of Georgia      Peachtree City  GA
 16                                       Premier Bank              Denver  CO
 17                                     Edgebrook Bank             Chicago  IL
 18                             Doral Bank  En Español            San Juan  PR
 19                  Capitol City Bank & Trust Company             Atlanta  GA
 20                            Highland Community Bank             Chicago  IL
 21                   First National Bank of Crestview           Crestview  FL
 22                                 Northern Star Bank             Mankato  MN
 23             Frontier Bank, FSB D/B/A El Paseo Bank         Palm Desert  CA
 24              The National Republic Bank of Chicago             Chicago  IL

      CERT                Acquiring Institution        Closing Date  \
 0   10716                   Legend Bank, N. A.        May 31, 2019
 1   30570                   Royal Savings Bank   December 15, 2017
 2   17719                          Conway Bank    October 13, 2017
 3    1802            United Fidelity Bank, fsb        May 26, 2017
 4   30003  First-Citizens Bank & Trust Company         May 5, 2017
 5   58302                         Whitney Bank      April 28, 2017
 6   35495                    Cache Valley Bank       March 3, 2017
 7   19328                  State Bank of Texas    January 27, 2017
 8   34951  First-Citizens Bank & Trust Company    January 13, 2017
 9      91                         Today's Bank  September 23, 2016
 10  11297                          United Bank     August 19, 2016
 11  35312  First-Citizens Bank & Trust Company         May 6, 2016
 12   9956           The Bank of Fayette County      April 29, 2016
 13  20364  First-Citizens Bank & Trust Company      March 11, 2016
 14  35156                       Twin City Bank     October 2, 2015
 15  35259                        Fidelity Bank     October 2, 2015
 16  34112            United Fidelity Bank, fsb       July 10, 2015
 17  57772             Republic Bank of Chicago         May 8, 2015
 18  32102         Banco Popular de Puerto Rico   February 27, 2015
 19  33938  First-Citizens Bank & Trust Company   February 13, 2015
 20  20290            United Fidelity Bank, fsb    January 23, 2015
 21  17557                       First NBC Bank    January 16, 2015
 22  34983                            BankVista   December 19, 2014
 23  34738    Bank of Southern California, N.A.    November 7, 2014
 24    916                  State Bank of Texas    October 24, 2014

           Updated Date
 0        June 18, 2019
 1        July 24, 2019
 2        July 24, 2019
 3     January 29, 2019
 4       March 22, 2018
 5     January 29, 2019
 6     January 29, 2019
 7     January 29, 2019
 8         May 18, 2017
 9         May 13, 2019
 10   December 13, 2018
 11   November 13, 2018
 12  September 14, 2018
 13    January 29, 2019
 14   February 19, 2018
 15        July 9, 2018
 16   February 20, 2018
 17    January 29, 2019
 18    January 29, 2019
 19    January 29, 2019
 20   November 15, 2017
 21   November 15, 2017
 22     January 3, 2018
 23   November 10, 2016
 24     January 6, 2016  ]